app/controllers/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)
    respond_to do |f|
      if @pin.save
---
INSERT INTO "pins" ("description", "title", "lat", "lng", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Test 3"], ["title", "Test 3"], ["lat", 43.647477], ["lng", -79.38709], ["created_at", "2015-06-05 16:51:26.106370"], ["updated_at", "2015-06-05 16:51:26.106370"]]