app/controllers/users_controller.rb

INSERT INTO "users" ("facebook_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["facebook_id", 10153512699743949], ["created_at", "2015-06-07 00:08:32.050523"], ["updated_at", "2015-06-07 00:08:32.050523"]]
SELECT  "users".* FROM "users" WHERE "users"."facebook_id" = ? LIMIT 1  [["facebook_id", 10153512699743949]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Su Mp"], ["updated_at", "2015-06-06 22:18:54.519959"], ["id", 2]]
SELECT "pins".* FROM "pins"
---
  def login
    @user = User.koala(request.env['omniauth.auth']['credentials'])
		u = User.find_or_create_by(facebook_id: @user.entries[0][1])
		u.name = @user.entries[1][1] + " " + @user.entries[3][1]
		u.save!
		binding.pry
    @pins = Pin.all